{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "13577ad8",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pprint import pprint\n",
    "import querif"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d4bda66a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# pprint(querif.const.list_queries())\n",
    "# print()\n",
    "# pprint(querif.const.list_templates())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9d5ff8c7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# desc, query = querif.const.get_query(\"Barack_Obama\")\n",
    "# print(desc)\n",
    "# print(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fc0d9ab9",
   "metadata": {},
   "outputs": [],
   "source": [
    "# results = querif.execute_query(query)\n",
    "# pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dbf75684",
   "metadata": {},
   "outputs": [],
   "source": [
    "# querif.analyze.plot_clusters(querif.analyze.cluster_embeddings_KMeans(results))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "49087d63",
   "metadata": {},
   "outputs": [],
   "source": [
    "# desc, query = utils.get_parametrized_query(t_label=\"Artist_Albums\", pr_labels='dbpedia', artist_name=\"Adele\", limit=5)\n",
    "# print(desc)\n",
    "# print(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6e024717",
   "metadata": {},
   "outputs": [],
   "source": [
    "# results = utils.execute_query(query)\n",
    "# pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1990a94e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = utils.llm.create_query(\"List the capitals of all countries in Europe.\", config_key=\"DEEPSEEK\")\n",
    "# print(query, \"\\n\")\n",
    "# results = utils.execute_query(query)\n",
    "# pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "b7625b5d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Detected query type: FACT_LOOKUP\n",
      "Generated query:\n",
      " PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "\n",
      "SELECT ?birthDate WHERE {\n",
      "    dbr:Michael_Jackson dbo:birthDate ?birthDate .\n",
      "} \n",
      "\n",
      "{'head': {'link': [], 'vars': ['birthDate']},\n",
      " 'results': {'bindings': [{'birthDate': {'datatype': 'http://www.w3.org/2001/XMLSchema#date',\n",
      "                                         'type': 'literal',\n",
      "                                         'value': '1958-08-29'}}],\n",
      "             'distinct': False,\n",
      "             'ordered': True}}\n"
     ]
    }
   ],
   "source": [
    "prompt = \"When was Michael Jackson born?\"\n",
    "query, results = querif.generate_and_execute_query(prompt, config_key=\"DEEPSEEK\")\n",
    "print(\"Generated query:\\n\", query, \"\\n\")\n",
    "pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "17d71c5f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Detected query type: CLASS_QUERY\n",
      "Entities: {'American': 'dbr:United_States', 'musicians': 'dbr:Musician', 'won': 'dbr:South_Korean_won', 'Grammy': 'dbr:Grammy_Awards', 'times': 'dbr:Cap_(sport)'}\n",
      "Target classes: ['dbo:Person']\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/grisha/Developer/WS/querif/nl2sparql/utils.py:282: RuntimeWarning: Failed to verify properties for dbo:Person: QueryBadFormed: A bad request has been sent to the endpoint: probably the SPARQL query is badly formed. \n",
      "\n",
      "Response:\n",
      "b\"Virtuoso 37000 Error SP030: SPARQL compiler, line 22: syntax error at '/' before 'height'\\n\\nSPARQL query:\\n#output-format:application/sparql-results+json\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX dbr: <http://dbpedia.org/resource/>\\nPREFIX dbo: <http://dbpedia.org/ontology/>\\nPREFIX dbp: <http://dbpedia.org/property/>\\nPREFIX dbc: <http://dbpedia.org/resource/Category:>\\nPREFIX dbt: <http://dbpedia.org/resource/Template:>\\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\\nPREFIX dc: <http://purl.org/dc/elements/1.1/>\\nPREFIX dcterms: <http://purl.org/dc/terms/>\\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\\nPREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\nPREFIX georss: <http://www.georss.org/georss/>\\nPREFIX prov: <http://www.w3.org/ns/prov#>\\nPREFIX wikidata: <http://www.wikidata.org/entity/>\\nPREFIX schema: <http://schema.org/>\\n\\n    SELECT DISTINCT ?property WHERE {\\n        VALUES (?property) { (dbo:Person/height) (dbo:Person/weight) (dbo:activeYears) (dbo:allegiance) (dbo:birthName) (dbo:birthYear) (dbo:deathYear) (dbo:eyeColor) (dbo:hairColor) (dbo:pseudonym) (dbo:signature) (dbo:networth) (dbo:sex) (dbo:electionDate) (dbo:activeYearsEndDateMgr) (dbo:activeYearsEndYearMgr) (dbo:activeYearsStartDateMgr) (dbo:activeYearsStartYearMgr) (dbo:affair) (dbo:arrestDate) }\\n        ?s rdf:type dbo:Person ;\\n           ?property ?o .\\n    }\\n    \\n\"\n",
      "  warnings.warn(f\"Failed to verify properties for {class_uri}: {e}\", RuntimeWarning)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Props of t. class {'data': ['dbo:Person/height', 'dbo:Person/weight', 'dbo:activeYears', 'dbo:allegiance', 'dbo:birthName', 'dbo:birthYear', 'dbo:deathYear', 'dbo:eyeColor', 'dbo:hairColor', 'dbo:pseudonym', 'dbo:signature', 'dbo:networth', 'dbo:sex', 'dbo:electionDate', 'dbo:activeYearsEndDateMgr', 'dbo:activeYearsEndYearMgr', 'dbo:activeYearsStartDateMgr', 'dbo:activeYearsStartYearMgr', 'dbo:affair', 'dbo:arrestDate'], 'object': ['dbo:agency', 'dbo:almaMater', 'dbo:board', 'dbo:careerStation', 'dbo:child', 'dbo:citizenship', 'dbo:college', 'dbo:deathCause', 'dbo:education', 'dbo:employer', 'dbo:militaryService', 'dbo:nationality', 'dbo:notableIdea', 'dbo:parent', 'dbo:partner', 'dbo:personFunction', 'dbo:philosophicalSchool', 'dbo:profession', 'dbo:relation', 'dbo:relative']}\n",
      "Generated query:\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX dbp: <http://dbpedia.org/property/>\n",
      "\n",
      "SELECT DISTINCT ?person ?label\n",
      "WHERE {\n",
      "    ?person a dbo:Person .\n",
      "    ?person rdfs:label ?label .\n",
      "    FILTER(lang(?label) = \"en\")\n",
      "\n",
      "    ?person dbo:nationality dbr:United_States .\n",
      "\n",
      "    ?person dbo:occupation ?occ .\n",
      "    ?occ a dbr:Musician .\n",
      "\n",
      "    ?person dbp:awards ?awards .\n",
      "    FILTER(CONTAINS(LCASE(?awards), \"grammy\"))\n",
      "\n",
      "    OPTIONAL {\n",
      "        ?person dbo:award ?awardList .\n",
      "        FILTER(CONTAINS(LCASE(?awardList), \"grammy\"))\n",
      "    }\n",
      "}\n",
      "LIMIT 100\n",
      "Generated query:\n",
      " None \n",
      "\n",
      "None\n"
     ]
    }
   ],
   "source": [
    "prompt = \"American musicians who won a Grammy award more than 15 times\"\n",
    "query, results = querif.generate_and_execute_query(prompt, config_key=\"DEEPSEEK\")\n",
    "print(\"Generated query:\\n\", query, \"\\n\")\n",
    "pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "fba53fc9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Detected query type: AGGREGATION\n"
     ]
    },
    {
     "ename": "QueryBadFormed",
     "evalue": "QueryBadFormed: A bad request has been sent to the endpoint: probably the SPARQL query is badly formed. \n\nResponse:\nb'Virtuoso 37000 Error SP030: SPARQL compiler, line 22: syntax error at \\'TV_series\\' before \\')\\'\\n\\nSPARQL query:\\n#output-format:application/sparql-results+json\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX dbr: <http://dbpedia.org/resource/>\\nPREFIX dbo: <http://dbpedia.org/ontology/>\\nPREFIX dbp: <http://dbpedia.org/property/>\\nPREFIX dbc: <http://dbpedia.org/resource/Category:>\\nPREFIX dbt: <http://dbpedia.org/resource/Template:>\\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\\nPREFIX dc: <http://purl.org/dc/elements/1.1/>\\nPREFIX dcterms: <http://purl.org/dc/terms/>\\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\\nPREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\nPREFIX georss: <http://www.georss.org/georss/>\\nPREFIX prov: <http://www.w3.org/ns/prov#>\\nPREFIX wikidata: <http://www.wikidata.org/entity/>\\nPREFIX schema: <http://schema.org/>\\n\\n    SELECT DISTINCT ?property ?value WHERE {\\n        dbr:How_(TV_series) ?property ?value .\\n        FILTER(!STRSTARTS(STR(?property), \"http://www.w3.org/2002/07/owl#\") && !STRSTARTS(STR(?property), \"http://www.w3.org/ns/prov#\") && !STRSTARTS(STR(?property), \"http://dbpedia.org/resource/Template:\") && !STRSTARTS(STR(?property), \"http://www.wikidata.org/entity/\") && !STRSTARTS(STR(?property), \"http://purl.org/linguistics/gold/\"))\\n    } LIMIT 20\\n    \\n'",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mHTTPError\u001b[39m                                 Traceback (most recent call last)",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/.venv/lib/python3.13/site-packages/SPARQLWrapper/Wrapper.py:926\u001b[39m, in \u001b[36mSPARQLWrapper._query\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    925\u001b[39m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m926\u001b[39m     response = \u001b[43murlopener\u001b[49m\u001b[43m(\u001b[49m\u001b[43mrequest\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    927\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m response, \u001b[38;5;28mself\u001b[39m.returnFormat\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:189\u001b[39m, in \u001b[36murlopen\u001b[39m\u001b[34m(url, data, timeout, context)\u001b[39m\n\u001b[32m    188\u001b[39m     opener = _opener\n\u001b[32m--> \u001b[39m\u001b[32m189\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mopener\u001b[49m\u001b[43m.\u001b[49m\u001b[43mopen\u001b[49m\u001b[43m(\u001b[49m\u001b[43murl\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mdata\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:495\u001b[39m, in \u001b[36mOpenerDirector.open\u001b[39m\u001b[34m(self, fullurl, data, timeout)\u001b[39m\n\u001b[32m    494\u001b[39m     meth = \u001b[38;5;28mgetattr\u001b[39m(processor, meth_name)\n\u001b[32m--> \u001b[39m\u001b[32m495\u001b[39m     response = \u001b[43mmeth\u001b[49m\u001b[43m(\u001b[49m\u001b[43mreq\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mresponse\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    497\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m response\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:604\u001b[39m, in \u001b[36mHTTPErrorProcessor.http_response\u001b[39m\u001b[34m(self, request, response)\u001b[39m\n\u001b[32m    603\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m (\u001b[32m200\u001b[39m <= code < \u001b[32m300\u001b[39m):\n\u001b[32m--> \u001b[39m\u001b[32m604\u001b[39m     response = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43mparent\u001b[49m\u001b[43m.\u001b[49m\u001b[43merror\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m    605\u001b[39m \u001b[43m        \u001b[49m\u001b[33;43m'\u001b[39;49m\u001b[33;43mhttp\u001b[39;49m\u001b[33;43m'\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mrequest\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mresponse\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mcode\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mmsg\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mhdrs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    607\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m response\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:533\u001b[39m, in \u001b[36mOpenerDirector.error\u001b[39m\u001b[34m(self, proto, *args)\u001b[39m\n\u001b[32m    532\u001b[39m args = (\u001b[38;5;28mdict\u001b[39m, \u001b[33m'\u001b[39m\u001b[33mdefault\u001b[39m\u001b[33m'\u001b[39m, \u001b[33m'\u001b[39m\u001b[33mhttp_error_default\u001b[39m\u001b[33m'\u001b[39m) + orig_args\n\u001b[32m--> \u001b[39m\u001b[32m533\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_call_chain\u001b[49m\u001b[43m(\u001b[49m\u001b[43m*\u001b[49m\u001b[43margs\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:466\u001b[39m, in \u001b[36mOpenerDirector._call_chain\u001b[39m\u001b[34m(self, chain, kind, meth_name, *args)\u001b[39m\n\u001b[32m    465\u001b[39m func = \u001b[38;5;28mgetattr\u001b[39m(handler, meth_name)\n\u001b[32m--> \u001b[39m\u001b[32m466\u001b[39m result = \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[43m*\u001b[49m\u001b[43margs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    467\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m result \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:613\u001b[39m, in \u001b[36mHTTPDefaultErrorHandler.http_error_default\u001b[39m\u001b[34m(self, req, fp, code, msg, hdrs)\u001b[39m\n\u001b[32m    612\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34mhttp_error_default\u001b[39m(\u001b[38;5;28mself\u001b[39m, req, fp, code, msg, hdrs):\n\u001b[32m--> \u001b[39m\u001b[32m613\u001b[39m     \u001b[38;5;28;01mraise\u001b[39;00m HTTPError(req.full_url, code, msg, hdrs, fp)\n",
      "\u001b[31mHTTPError\u001b[39m: HTTP Error 400: Bad Request",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[31mQueryBadFormed\u001b[39m                            Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[3]\u001b[39m\u001b[32m, line 2\u001b[39m\n\u001b[32m      1\u001b[39m prompt = \u001b[33m\"\u001b[39m\u001b[33mHow many Albums did Drake release?\u001b[39m\u001b[33m\"\u001b[39m\n\u001b[32m----> \u001b[39m\u001b[32m2\u001b[39m query, results = \u001b[43mquerif\u001b[49m\u001b[43m.\u001b[49m\u001b[43mgenerate_and_execute_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43mprompt\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mconfig_key\u001b[49m\u001b[43m=\u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mDEEPSEEK\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[32m      3\u001b[39m \u001b[38;5;28mprint\u001b[39m(\u001b[33m\"\u001b[39m\u001b[33mGenerated query:\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[33m\"\u001b[39m, query, \u001b[33m\"\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[33m\"\u001b[39m)\n\u001b[32m      4\u001b[39m pprint(results)\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/querif/nl2sparql/main.py:29\u001b[39m, in \u001b[36mgenerate_and_execute_query\u001b[39m\u001b[34m(prompt, config_key)\u001b[39m\n\u001b[32m     27\u001b[39m handler = handlers.get(query_type)\n\u001b[32m     28\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m handler:\n\u001b[32m---> \u001b[39m\u001b[32m29\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mhandler\u001b[49m\u001b[43m(\u001b[49m\u001b[43mprompt\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mconfig_key\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m     31\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m, \u001b[38;5;28;01mNone\u001b[39;00m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/querif/nl2sparql/queries/aggregation.py:57\u001b[39m, in \u001b[36mgenerate_aggregation_query\u001b[39m\u001b[34m(prompt, config_key)\u001b[39m\n\u001b[32m     55\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m entities:\n\u001b[32m     56\u001b[39m     main_entity = \u001b[38;5;28mlist\u001b[39m(entities.values())[\u001b[32m0\u001b[39m]\n\u001b[32m---> \u001b[39m\u001b[32m57\u001b[39m     props = \u001b[43m_get_entity_properties\u001b[49m\u001b[43m(\u001b[49m\u001b[43mmain_entity\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mlimit\u001b[49m\u001b[43m=\u001b[49m\u001b[32;43m20\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[32m     58\u001b[39m     props_str = \u001b[33m\"\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[33m\"\u001b[39m.join([\u001b[33mf\u001b[39m\u001b[33m\"\u001b[39m\u001b[33m  \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mp[\u001b[33m'\u001b[39m\u001b[33mproperty\u001b[39m\u001b[33m'\u001b[39m]\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m\"\u001b[39m \u001b[38;5;28;01mfor\u001b[39;00m p \u001b[38;5;129;01min\u001b[39;00m props])\n\u001b[32m     59\u001b[39m \u001b[38;5;28;01melse\u001b[39;00m:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/querif/nl2sparql/utils.py:338\u001b[39m, in \u001b[36m_get_entity_properties\u001b[39m\u001b[34m(entity_uri, limit)\u001b[39m\n\u001b[32m    330\u001b[39m exclusion_filters = \u001b[33m\"\u001b[39m\u001b[33m && \u001b[39m\u001b[33m\"\u001b[39m.join([\u001b[33mf\u001b[39m\u001b[33m'\u001b[39m\u001b[33m!STRSTARTS(STR(?property), \u001b[39m\u001b[33m\"\u001b[39m\u001b[38;5;132;01m{\u001b[39;00muri\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m\"\u001b[39m\u001b[33m)\u001b[39m\u001b[33m'\u001b[39m \u001b[38;5;28;01mfor\u001b[39;00m uri \u001b[38;5;129;01min\u001b[39;00m EXCLUDED_NAMESPACES])\n\u001b[32m    332\u001b[39m query = \u001b[33mf\u001b[39m\u001b[33m\"\"\"\u001b[39m\n\u001b[32m    333\u001b[39m \u001b[33mSELECT DISTINCT ?property ?value WHERE \u001b[39m\u001b[38;5;130;01m{{\u001b[39;00m\n\u001b[32m    334\u001b[39m \u001b[33m    \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mentity_uri\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m ?property ?value .\u001b[39m\n\u001b[32m    335\u001b[39m \u001b[33m    FILTER(\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mexclusion_filters\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m)\u001b[39m\n\u001b[32m    336\u001b[39m \u001b[33m\u001b[39m\u001b[38;5;130;01m}}\u001b[39;00m\u001b[33m LIMIT \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mlimit\u001b[38;5;132;01m}\u001b[39;00m\n\u001b[32m    337\u001b[39m \u001b[33m\u001b[39m\u001b[33m\"\"\"\u001b[39m\n\u001b[32m--> \u001b[39m\u001b[32m338\u001b[39m results = \u001b[43mexecute_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43mprefixes\u001b[49m\u001b[43m \u001b[49m\u001b[43m+\u001b[49m\u001b[43m \u001b[49m\u001b[43mquery\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    340\u001b[39m props = []\n\u001b[32m    341\u001b[39m \u001b[38;5;28;01mfor\u001b[39;00m r \u001b[38;5;129;01min\u001b[39;00m results[\u001b[33m\"\u001b[39m\u001b[33mresults\u001b[39m\u001b[33m\"\u001b[39m][\u001b[33m\"\u001b[39m\u001b[33mbindings\u001b[39m\u001b[33m\"\u001b[39m]:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/querif/execute.py:11\u001b[39m, in \u001b[36mexecute_query\u001b[39m\u001b[34m(query)\u001b[39m\n\u001b[32m      9\u001b[39m sparql.setQuery(query)\n\u001b[32m     10\u001b[39m sparql.setReturnFormat(JSON)\n\u001b[32m---> \u001b[39m\u001b[32m11\u001b[39m results = \u001b[43msparql\u001b[49m\u001b[43m.\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m.convert()\n\u001b[32m     12\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m results\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/.venv/lib/python3.13/site-packages/SPARQLWrapper/Wrapper.py:960\u001b[39m, in \u001b[36mSPARQLWrapper.query\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    942\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34mquery\u001b[39m(\u001b[38;5;28mself\u001b[39m) -> \u001b[33m\"\u001b[39m\u001b[33mQueryResult\u001b[39m\u001b[33m\"\u001b[39m:\n\u001b[32m    943\u001b[39m \u001b[38;5;250m    \u001b[39m\u001b[33;03m\"\"\"\u001b[39;00m\n\u001b[32m    944\u001b[39m \u001b[33;03m    Execute the query.\u001b[39;00m\n\u001b[32m    945\u001b[39m \u001b[33;03m    Exceptions can be raised if either the URI is wrong or the HTTP sends back an error (this is also the\u001b[39;00m\n\u001b[32m   (...)\u001b[39m\u001b[32m    958\u001b[39m \u001b[33;03m    :rtype: :class:`QueryResult` instance\u001b[39;00m\n\u001b[32m    959\u001b[39m \u001b[33;03m    \"\"\"\u001b[39;00m\n\u001b[32m--> \u001b[39m\u001b[32m960\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m QueryResult(\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m)\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/.venv/lib/python3.13/site-packages/SPARQLWrapper/Wrapper.py:930\u001b[39m, in \u001b[36mSPARQLWrapper._query\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    928\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m urllib.error.HTTPError \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[32m    929\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m e.code == \u001b[32m400\u001b[39m:\n\u001b[32m--> \u001b[39m\u001b[32m930\u001b[39m         \u001b[38;5;28;01mraise\u001b[39;00m QueryBadFormed(e.read())\n\u001b[32m    931\u001b[39m     \u001b[38;5;28;01melif\u001b[39;00m e.code == \u001b[32m404\u001b[39m:\n\u001b[32m    932\u001b[39m         \u001b[38;5;28;01mraise\u001b[39;00m EndPointNotFound(e.read())\n",
      "\u001b[31mQueryBadFormed\u001b[39m: QueryBadFormed: A bad request has been sent to the endpoint: probably the SPARQL query is badly formed. \n\nResponse:\nb'Virtuoso 37000 Error SP030: SPARQL compiler, line 22: syntax error at \\'TV_series\\' before \\')\\'\\n\\nSPARQL query:\\n#output-format:application/sparql-results+json\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX dbr: <http://dbpedia.org/resource/>\\nPREFIX dbo: <http://dbpedia.org/ontology/>\\nPREFIX dbp: <http://dbpedia.org/property/>\\nPREFIX dbc: <http://dbpedia.org/resource/Category:>\\nPREFIX dbt: <http://dbpedia.org/resource/Template:>\\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\\nPREFIX dc: <http://purl.org/dc/elements/1.1/>\\nPREFIX dcterms: <http://purl.org/dc/terms/>\\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\\nPREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\nPREFIX georss: <http://www.georss.org/georss/>\\nPREFIX prov: <http://www.w3.org/ns/prov#>\\nPREFIX wikidata: <http://www.wikidata.org/entity/>\\nPREFIX schema: <http://schema.org/>\\n\\n    SELECT DISTINCT ?property ?value WHERE {\\n        dbr:How_(TV_series) ?property ?value .\\n        FILTER(!STRSTARTS(STR(?property), \"http://www.w3.org/2002/07/owl#\") && !STRSTARTS(STR(?property), \"http://www.w3.org/ns/prov#\") && !STRSTARTS(STR(?property), \"http://dbpedia.org/resource/Template:\") && !STRSTARTS(STR(?property), \"http://www.wikidata.org/entity/\") && !STRSTARTS(STR(?property), \"http://purl.org/linguistics/gold/\"))\\n    } LIMIT 20\\n    \\n'"
     ]
    }
   ],
   "source": [
    "prompt = \"How many Albums did Drake release?\"\n",
    "query, results = querif.generate_and_execute_query(prompt, config_key=\"DEEPSEEK\")\n",
    "print(\"Generated query:\\n\", query, \"\\n\")\n",
    "pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "6dc60a6f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Detected query type: COMPARISON\n",
      "Generated query:\n",
      " PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "\n",
      "SELECT ?entity ?label ?birthDate\n",
      "WHERE {\n",
      "  VALUES ?entity { dbr:Taylor_Swift dbr:Katy_Perry }\n",
      "  ?entity dbo:birthDate ?birthDate ;\n",
      "          rdfs:label ?label .\n",
      "  FILTER(lang(?label) = \"en\")\n",
      "}\n",
      "ORDER BY ?birthDate \n",
      "\n",
      "{'head': {'link': [], 'vars': ['entity', 'label', 'birthDate']},\n",
      " 'results': {'bindings': [{'birthDate': {'datatype': 'http://www.w3.org/2001/XMLSchema#date',\n",
      "                                         'type': 'literal',\n",
      "                                         'value': '1984-10-25'},\n",
      "                           'entity': {'type': 'uri',\n",
      "                                      'value': 'http://dbpedia.org/resource/Katy_Perry'},\n",
      "                           'label': {'type': 'literal',\n",
      "                                     'value': 'Katy Perry',\n",
      "                                     'xml:lang': 'en'}},\n",
      "                          {'birthDate': {'datatype': 'http://www.w3.org/2001/XMLSchema#date',\n",
      "                                         'type': 'literal',\n",
      "                                         'value': '1989-12-13'},\n",
      "                           'entity': {'type': 'uri',\n",
      "                                      'value': 'http://dbpedia.org/resource/Taylor_Swift'},\n",
      "                           'label': {'type': 'literal',\n",
      "                                     'value': 'Taylor Swift',\n",
      "                                     'xml:lang': 'en'}}],\n",
      "             'distinct': False,\n",
      "             'ordered': True}}\n"
     ]
    }
   ],
   "source": [
    "prompt = \"Who is older between Taylor Swift and Katy Perry?\"\n",
    "query, results = querif.generate_and_execute_query(prompt, config_key=\"DEEPSEEK\")\n",
    "print(\"Generated query:\\n\", query, \"\\n\")\n",
    "pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "913211fd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Detected query type: DEFINITION\n",
      "Generated query:\n",
      " \n",
      "    SELECT ?label ?abstract ?type WHERE {\n",
      "        dbr:String_theory rdfs:label ?label ;\n",
      "                      dbo:abstract ?abstract .\n",
      "        OPTIONAL { dbr:String_theory rdf:type ?type . }\n",
      "        FILTER (lang(?label) = \"en\" && lang(?abstract) = \"en\")\n",
      "    } LIMIT 1\n",
      "     \n",
      "\n",
      "{'head': {'link': [], 'vars': ['label', 'abstract', 'type']},\n",
      " 'results': {'bindings': [], 'distinct': False, 'ordered': True}}\n"
     ]
    }
   ],
   "source": [
    "prompt = \"What is jazz?\"\n",
    "query, results = querif.generate_and_execute_query(prompt, config_key=\"DEEPSEEK\")\n",
    "print(\"Generated query:\\n\", query, \"\\n\")\n",
    "pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "59992cc6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Detected query type: RELATIONSHIP\n"
     ]
    },
    {
     "ename": "QueryBadFormed",
     "evalue": "QueryBadFormed: A bad request has been sent to the endpoint: probably the SPARQL query is badly formed. \n\nResponse:\nb'Virtuoso 37000 Error SP030: SPARQL compiler, line 23: syntax error at \\'TV_series\\' before \\')\\'\\n\\nSPARQL query:\\n#output-format:application/sparql-results+json\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX dbr: <http://dbpedia.org/resource/>\\nPREFIX dbo: <http://dbpedia.org/ontology/>\\nPREFIX dbp: <http://dbpedia.org/property/>\\nPREFIX dbc: <http://dbpedia.org/resource/Category:>\\nPREFIX dbt: <http://dbpedia.org/resource/Template:>\\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\\nPREFIX dc: <http://purl.org/dc/elements/1.1/>\\nPREFIX dcterms: <http://purl.org/dc/terms/>\\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\\nPREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\nPREFIX georss: <http://www.georss.org/georss/>\\nPREFIX prov: <http://www.w3.org/ns/prov#>\\nPREFIX wikidata: <http://www.wikidata.org/entity/>\\nPREFIX schema: <http://schema.org/>\\n\\n    SELECT ?predicate ?direction WHERE {\\n        {\\n            dbr:How_(TV_series) ?predicate dbr:Jazz .\\n            BIND(\"forward\" AS ?direction)\\n        }\\n        UNION\\n        {\\n            dbr:Jazz ?predicate dbr:How_(TV_series) .\\n            BIND(\"reverse\" AS ?direction)\\n        }\\n    }\\n    \\n'",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mHTTPError\u001b[39m                                 Traceback (most recent call last)",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/.venv/lib/python3.13/site-packages/SPARQLWrapper/Wrapper.py:926\u001b[39m, in \u001b[36mSPARQLWrapper._query\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    925\u001b[39m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m926\u001b[39m     response = \u001b[43murlopener\u001b[49m\u001b[43m(\u001b[49m\u001b[43mrequest\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    927\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m response, \u001b[38;5;28mself\u001b[39m.returnFormat\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:189\u001b[39m, in \u001b[36murlopen\u001b[39m\u001b[34m(url, data, timeout, context)\u001b[39m\n\u001b[32m    188\u001b[39m     opener = _opener\n\u001b[32m--> \u001b[39m\u001b[32m189\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mopener\u001b[49m\u001b[43m.\u001b[49m\u001b[43mopen\u001b[49m\u001b[43m(\u001b[49m\u001b[43murl\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mdata\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:495\u001b[39m, in \u001b[36mOpenerDirector.open\u001b[39m\u001b[34m(self, fullurl, data, timeout)\u001b[39m\n\u001b[32m    494\u001b[39m     meth = \u001b[38;5;28mgetattr\u001b[39m(processor, meth_name)\n\u001b[32m--> \u001b[39m\u001b[32m495\u001b[39m     response = \u001b[43mmeth\u001b[49m\u001b[43m(\u001b[49m\u001b[43mreq\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mresponse\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    497\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m response\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:604\u001b[39m, in \u001b[36mHTTPErrorProcessor.http_response\u001b[39m\u001b[34m(self, request, response)\u001b[39m\n\u001b[32m    603\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m (\u001b[32m200\u001b[39m <= code < \u001b[32m300\u001b[39m):\n\u001b[32m--> \u001b[39m\u001b[32m604\u001b[39m     response = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43mparent\u001b[49m\u001b[43m.\u001b[49m\u001b[43merror\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m    605\u001b[39m \u001b[43m        \u001b[49m\u001b[33;43m'\u001b[39;49m\u001b[33;43mhttp\u001b[39;49m\u001b[33;43m'\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mrequest\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mresponse\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mcode\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mmsg\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mhdrs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    607\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m response\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:533\u001b[39m, in \u001b[36mOpenerDirector.error\u001b[39m\u001b[34m(self, proto, *args)\u001b[39m\n\u001b[32m    532\u001b[39m args = (\u001b[38;5;28mdict\u001b[39m, \u001b[33m'\u001b[39m\u001b[33mdefault\u001b[39m\u001b[33m'\u001b[39m, \u001b[33m'\u001b[39m\u001b[33mhttp_error_default\u001b[39m\u001b[33m'\u001b[39m) + orig_args\n\u001b[32m--> \u001b[39m\u001b[32m533\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_call_chain\u001b[49m\u001b[43m(\u001b[49m\u001b[43m*\u001b[49m\u001b[43margs\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:466\u001b[39m, in \u001b[36mOpenerDirector._call_chain\u001b[39m\u001b[34m(self, chain, kind, meth_name, *args)\u001b[39m\n\u001b[32m    465\u001b[39m func = \u001b[38;5;28mgetattr\u001b[39m(handler, meth_name)\n\u001b[32m--> \u001b[39m\u001b[32m466\u001b[39m result = \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[43m*\u001b[49m\u001b[43margs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    467\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m result \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/opt/homebrew/Cellar/python@3.13/3.13.7/Frameworks/Python.framework/Versions/3.13/lib/python3.13/urllib/request.py:613\u001b[39m, in \u001b[36mHTTPDefaultErrorHandler.http_error_default\u001b[39m\u001b[34m(self, req, fp, code, msg, hdrs)\u001b[39m\n\u001b[32m    612\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34mhttp_error_default\u001b[39m(\u001b[38;5;28mself\u001b[39m, req, fp, code, msg, hdrs):\n\u001b[32m--> \u001b[39m\u001b[32m613\u001b[39m     \u001b[38;5;28;01mraise\u001b[39;00m HTTPError(req.full_url, code, msg, hdrs, fp)\n",
      "\u001b[31mHTTPError\u001b[39m: HTTP Error 400: Bad Request",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[31mQueryBadFormed\u001b[39m                            Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[3]\u001b[39m\u001b[32m, line 2\u001b[39m\n\u001b[32m      1\u001b[39m prompt = \u001b[33m\"\u001b[39m\u001b[33mHow jazz and rap are related?\u001b[39m\u001b[33m\"\u001b[39m\n\u001b[32m----> \u001b[39m\u001b[32m2\u001b[39m query, results = \u001b[43mquerif\u001b[49m\u001b[43m.\u001b[49m\u001b[43mgenerate_and_execute_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43mprompt\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mconfig_key\u001b[49m\u001b[43m=\u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mDEEPSEEK\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[32m      3\u001b[39m \u001b[38;5;28mprint\u001b[39m(\u001b[33m\"\u001b[39m\u001b[33mGenerated query:\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[33m\"\u001b[39m, query, \u001b[33m\"\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[33m\"\u001b[39m)\n\u001b[32m      4\u001b[39m pprint(results)\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/querif/nl2sparql/main.py:29\u001b[39m, in \u001b[36mgenerate_and_execute_query\u001b[39m\u001b[34m(prompt, config_key)\u001b[39m\n\u001b[32m     27\u001b[39m handler = handlers.get(query_type)\n\u001b[32m     28\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m handler:\n\u001b[32m---> \u001b[39m\u001b[32m29\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mhandler\u001b[49m\u001b[43m(\u001b[49m\u001b[43mprompt\u001b[49m\u001b[43m=\u001b[49m\u001b[43mprompt\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mconfig_key\u001b[49m\u001b[43m=\u001b[49m\u001b[43mconfig_key\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m     31\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m, \u001b[38;5;28;01mNone\u001b[39;00m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/querif/nl2sparql/queries/relationship.py:37\u001b[39m, in \u001b[36mgenerate_relationship_query\u001b[39m\u001b[34m(prompt, **other)\u001b[39m\n\u001b[32m     22\u001b[39m \u001b[38;5;66;03m# Find direct relationships\u001b[39;00m\n\u001b[32m     23\u001b[39m query = \u001b[33mf\u001b[39m\u001b[33m\"\"\"\u001b[39m\n\u001b[32m     24\u001b[39m \u001b[33mSELECT ?predicate ?direction WHERE \u001b[39m\u001b[38;5;130;01m{{\u001b[39;00m\n\u001b[32m     25\u001b[39m \u001b[33m    \u001b[39m\u001b[38;5;130;01m{{\u001b[39;00m\n\u001b[32m   (...)\u001b[39m\u001b[32m     34\u001b[39m \u001b[33m\u001b[39m\u001b[38;5;130;01m}}\u001b[39;00m\n\u001b[32m     35\u001b[39m \u001b[33m\u001b[39m\u001b[33m\"\"\"\u001b[39m\n\u001b[32m---> \u001b[39m\u001b[32m37\u001b[39m results = \u001b[43mexecute_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43mprefixes\u001b[49m\u001b[43m \u001b[49m\u001b[43m+\u001b[49m\u001b[43m \u001b[49m\u001b[43mquery\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m     38\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m query, results\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/querif/execute.py:11\u001b[39m, in \u001b[36mexecute_query\u001b[39m\u001b[34m(query)\u001b[39m\n\u001b[32m      9\u001b[39m sparql.setQuery(query)\n\u001b[32m     10\u001b[39m sparql.setReturnFormat(JSON)\n\u001b[32m---> \u001b[39m\u001b[32m11\u001b[39m results = \u001b[43msparql\u001b[49m\u001b[43m.\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m.convert()\n\u001b[32m     12\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m results\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/.venv/lib/python3.13/site-packages/SPARQLWrapper/Wrapper.py:960\u001b[39m, in \u001b[36mSPARQLWrapper.query\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    942\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34mquery\u001b[39m(\u001b[38;5;28mself\u001b[39m) -> \u001b[33m\"\u001b[39m\u001b[33mQueryResult\u001b[39m\u001b[33m\"\u001b[39m:\n\u001b[32m    943\u001b[39m \u001b[38;5;250m    \u001b[39m\u001b[33;03m\"\"\"\u001b[39;00m\n\u001b[32m    944\u001b[39m \u001b[33;03m    Execute the query.\u001b[39;00m\n\u001b[32m    945\u001b[39m \u001b[33;03m    Exceptions can be raised if either the URI is wrong or the HTTP sends back an error (this is also the\u001b[39;00m\n\u001b[32m   (...)\u001b[39m\u001b[32m    958\u001b[39m \u001b[33;03m    :rtype: :class:`QueryResult` instance\u001b[39;00m\n\u001b[32m    959\u001b[39m \u001b[33;03m    \"\"\"\u001b[39;00m\n\u001b[32m--> \u001b[39m\u001b[32m960\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m QueryResult(\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m)\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Developer/WS/.venv/lib/python3.13/site-packages/SPARQLWrapper/Wrapper.py:930\u001b[39m, in \u001b[36mSPARQLWrapper._query\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    928\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m urllib.error.HTTPError \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[32m    929\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m e.code == \u001b[32m400\u001b[39m:\n\u001b[32m--> \u001b[39m\u001b[32m930\u001b[39m         \u001b[38;5;28;01mraise\u001b[39;00m QueryBadFormed(e.read())\n\u001b[32m    931\u001b[39m     \u001b[38;5;28;01melif\u001b[39;00m e.code == \u001b[32m404\u001b[39m:\n\u001b[32m    932\u001b[39m         \u001b[38;5;28;01mraise\u001b[39;00m EndPointNotFound(e.read())\n",
      "\u001b[31mQueryBadFormed\u001b[39m: QueryBadFormed: A bad request has been sent to the endpoint: probably the SPARQL query is badly formed. \n\nResponse:\nb'Virtuoso 37000 Error SP030: SPARQL compiler, line 23: syntax error at \\'TV_series\\' before \\')\\'\\n\\nSPARQL query:\\n#output-format:application/sparql-results+json\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX dbr: <http://dbpedia.org/resource/>\\nPREFIX dbo: <http://dbpedia.org/ontology/>\\nPREFIX dbp: <http://dbpedia.org/property/>\\nPREFIX dbc: <http://dbpedia.org/resource/Category:>\\nPREFIX dbt: <http://dbpedia.org/resource/Template:>\\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\\nPREFIX dc: <http://purl.org/dc/elements/1.1/>\\nPREFIX dcterms: <http://purl.org/dc/terms/>\\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\\nPREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\nPREFIX georss: <http://www.georss.org/georss/>\\nPREFIX prov: <http://www.w3.org/ns/prov#>\\nPREFIX wikidata: <http://www.wikidata.org/entity/>\\nPREFIX schema: <http://schema.org/>\\n\\n    SELECT ?predicate ?direction WHERE {\\n        {\\n            dbr:How_(TV_series) ?predicate dbr:Jazz .\\n            BIND(\"forward\" AS ?direction)\\n        }\\n        UNION\\n        {\\n            dbr:Jazz ?predicate dbr:How_(TV_series) .\\n            BIND(\"reverse\" AS ?direction)\\n        }\\n    }\\n    \\n'"
     ]
    }
   ],
   "source": [
    "prompt = \"How jazz and rap are related?\"\n",
    "query, results = querif.generate_and_execute_query(prompt, config_key=\"DEEPSEEK\")\n",
    "print(\"Generated query:\\n\", query, \"\\n\")\n",
    "pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "0ea45584",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Detected query type: SUPERLATIVE\n",
      "Generated query:\n",
      " PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dct: <http://purl.org/dc/terms/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "\n",
      "SELECT ?song ?title ?listens\n",
      "WHERE {\n",
      "  ?song a dbo:Song ;\n",
      "        dct:subject ?category ;\n",
      "        rdfs:label ?title ;\n",
      "        dbo:streams ?listens .\n",
      "  FILTER(LANG(?title) = 'en')\n",
      "  ?category rdfs:label \"French songs\"@en .\n",
      "}\n",
      "ORDER BY DESC(?listens)\n",
      "LIMIT 1 \n",
      "\n",
      "{'head': {'link': [], 'vars': ['song', 'title', 'listens']},\n",
      " 'results': {'bindings': [], 'distinct': False, 'ordered': True}}\n"
     ]
    }
   ],
   "source": [
    "prompt = \"Most listened french songs\"\n",
    "query, results = querif.generate_and_execute_query(prompt, config_key=\"DEEPSEEK\")\n",
    "print(\"Generated query:\\n\", query, \"\\n\")\n",
    "pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "5675984e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Detected query type: BOOLEAN\n",
      "Generated query:\n",
      " ASK {\n",
      "  dbr:Stromae dbo:nationality dbr:France .\n",
      "} \n",
      "\n",
      "{'boolean': False, 'head': {'link': []}}\n"
     ]
    }
   ],
   "source": [
    "prompt = \"Is stromae french?\"\n",
    "query, results = querif.generate_and_execute_query(prompt, config_key=\"DEEPSEEK\")\n",
    "print(\"Generated query:\\n\", query, \"\\n\")\n",
    "pprint(results)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
