{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "13577ad8",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pprint import pprint\n",
    "import utils"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "9d5ff8c7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Get labels of Barack Obama\n",
      "\n",
      "PREFIX dbr:  <http://dbpedia.org/resource/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX dbo:  <http://dbpedia.org/ontology/>\n",
      "SELECT ?object WHERE {dbr:Barack_Obama rdfs:label ?object.}\n"
     ]
    }
   ],
   "source": [
    "desc, query = utils.get_predefined_query(\"Barack_Obama\")\n",
    "print(desc)\n",
    "print(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "fc0d9ab9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'head': {'link': [], 'vars': ['object']},\n",
      " 'results': {'bindings': [{'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'en'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'باراك أوباما',\n",
      "                                      'xml:lang': 'ar'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'ca'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Μπαράκ Ομπάμα',\n",
      "                                      'xml:lang': 'el'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'cs'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'de'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'eo'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'eu'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'es'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'in'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'ga'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'fr'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'it'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'バラク・オバマ',\n",
      "                                      'xml:lang': 'ja'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': '버락 오바마',\n",
      "                                      'xml:lang': 'ko'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'nl'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'pt'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'pl'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Обама, Барак',\n",
      "                                      'xml:lang': 'ru'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Barack Obama',\n",
      "                                      'xml:lang': 'sv'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': 'Барак Обама',\n",
      "                                      'xml:lang': 'uk'}},\n",
      "                          {'object': {'type': 'literal',\n",
      "                                      'value': '贝拉克·奥巴马',\n",
      "                                      'xml:lang': 'zh'}}],\n",
      "             'distinct': False,\n",
      "             'ordered': True}}\n"
     ]
    }
   ],
   "source": [
    "results = utils.execute_query(query)\n",
    "pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "49087d63",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Get N most recent albums of a specified artist with release dates\n",
      "\n",
      "PREFIX dbr:  <http://dbpedia.org/resource/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX dbo:  <http://dbpedia.org/ontology/>\n",
      "\n",
      "SELECT DISTINCT ?album_label ?release_date WHERE {\n",
      "    ?artist rdfs:label \"Adele\"@en .\n",
      "    ?album dbo:artist ?artist ;\n",
      "            rdfs:label ?album_label ;\n",
      "            dbo:releaseDate ?release_date .\n",
      "    FILTER (lang(?album_label) = \"en\")\n",
      "}\n",
      "ORDER BY DESC(?release_date)\n",
      "LIMIT 5\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "desc, query = utils.get_parametrized_query(t_label=\"Artist_Albums\", artist_name=\"Adele\", limit=5)\n",
    "print(desc)\n",
    "print(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "6e024717",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'head': {'link': [], 'vars': ['album_label', 'release_date']},\n",
      " 'results': {'bindings': [{'album_label': {'type': 'literal',\n",
      "                                           'value': 'Oh My God (Adele song)',\n",
      "                                           'xml:lang': 'en'},\n",
      "                           'release_date': {'datatype': 'http://www.w3.org/2001/XMLSchema#date',\n",
      "                                            'type': 'literal',\n",
      "                                            'value': '2021-11-29'}},\n",
      "                          {'album_label': {'type': 'literal',\n",
      "                                           'value': 'Can I Get It',\n",
      "                                           'xml:lang': 'en'},\n",
      "                           'release_date': {'datatype': 'http://www.w3.org/2001/XMLSchema#date',\n",
      "                                            'type': 'literal',\n",
      "                                            'value': '2021-11-19'}},\n",
      "                          {'album_label': {'type': 'literal',\n",
      "                                           'value': 'My Little Love',\n",
      "                                           'xml:lang': 'en'},\n",
      "                           'release_date': {'datatype': 'http://www.w3.org/2001/XMLSchema#date',\n",
      "                                            'type': 'literal',\n",
      "                                            'value': '2021-11-19'}},\n",
      "                          {'album_label': {'type': 'literal',\n",
      "                                           'value': 'To Be Loved (Adele song)',\n",
      "                                           'xml:lang': 'en'},\n",
      "                           'release_date': {'datatype': 'http://www.w3.org/2001/XMLSchema#date',\n",
      "                                            'type': 'literal',\n",
      "                                            'value': '2021-11-19'}},\n",
      "                          {'album_label': {'type': 'literal',\n",
      "                                           'value': 'Easy on Me',\n",
      "                                           'xml:lang': 'en'},\n",
      "                           'release_date': {'datatype': 'http://www.w3.org/2001/XMLSchema#date',\n",
      "                                            'type': 'literal',\n",
      "                                            'value': '2021-10-15'}}],\n",
      "             'distinct': False,\n",
      "             'ordered': True}}\n"
     ]
    }
   ],
   "source": [
    "results = utils.execute_query(query)\n",
    "pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5e4776c7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Exécution de la requête sur dbpedia...\n"
     ]
    }
   ],
   "source": [
    "\n",
    "from utils.pipeline import pipeline_complet\n",
    "\n",
    "\n",
    "df_final = pipeline_complet(query, api=\"dbpedia\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
