{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "13577ad8",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pprint import pprint\n",
    "import utils"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "9d5ff8c7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Get labels of Barack Obama\n",
      "\n",
      "PREFIX dbr:  <http://dbpedia.org/resource/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX dbo:  <http://dbpedia.org/ontology/>\n",
      "PREFIX dbp: <http://dbpedia.org/property/>\n",
      "\n",
      "SELECT ?object WHERE {dbr:Barack_Obama rdfs:label ?object.}\n"
     ]
    }
   ],
   "source": [
    "desc, query = utils.get_predefined_query(\"Barack_Obama\", pr_labels='dbpedia')\n",
    "print(desc)\n",
    "print(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "fc0d9ab9",
   "metadata": {},
   "outputs": [],
   "source": [
    "# results = utils.execute_query(query)\n",
    "# pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "dbf75684",
   "metadata": {},
   "outputs": [],
   "source": [
    "# utils.plot_clusters(utils.cluster_embeddings_KMeans(results))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "49087d63",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Get N most recent albums of a specified artist with release dates\n",
      "\n",
      "PREFIX dbr:  <http://dbpedia.org/resource/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX dbo:  <http://dbpedia.org/ontology/>\n",
      "PREFIX dbp: <http://dbpedia.org/property/>\n",
      "\n",
      "\n",
      "SELECT DISTINCT ?album_label ?release_date WHERE {\n",
      "    ?artist rdfs:label \"Adele\"@en .\n",
      "    ?album dbo:artist ?artist ;\n",
      "            rdfs:label ?album_label ;\n",
      "            dbo:releaseDate ?release_date .\n",
      "    FILTER (lang(?album_label) = \"en\")\n",
      "}\n",
      "ORDER BY DESC(?release_date)\n",
      "LIMIT 5\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "desc, query = utils.get_parametrized_query(t_label=\"Artist_Albums\", pr_labels='dbpedia', artist_name=\"Adele\", limit=5)\n",
    "print(desc)\n",
    "print(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "6e024717",
   "metadata": {},
   "outputs": [],
   "source": [
    "# results = utils.execute_query(query)\n",
    "# pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "1990a94e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = utils.llm.create_query(\"List the capitals of all countries in Europe.\", config_key=\"DEEPSEEK\")\n",
    "# print(query, \"\\n\")\n",
    "# results = utils.execute_query(query)\n",
    "# pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "4bb92e4b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'comparators': ['>'],\n",
      " 'nouns': ['the capitals', 'all countries', 'Europe', 'number', 'citizens'],\n",
      " 'numbers': ['greater than 20 million']}\n",
      "{'@confidence': '0.5',\n",
      " '@policy': 'whitelist',\n",
      " '@sparql': '',\n",
      " '@support': '0',\n",
      " '@text': 'List the capitals of all countries in Europe with number of '\n",
      "          'citizens greater than 20 million.',\n",
      " '@types': '',\n",
      " 'Resources': [{'@URI': 'http://dbpedia.org/resource/Europe',\n",
      "                '@offset': '38',\n",
      "                '@percentageOfSecondRank': '0.0018414304748817039',\n",
      "                '@similarityScore': '0.9981260548047736',\n",
      "                '@support': '81911',\n",
      "                '@surfaceForm': 'Europe',\n",
      "                '@types': 'Schema:Place,Schema:Continent,DBpedia:PopulatedPlace,DBpedia:Place,DBpedia:Location,DBpedia:Continent'}]}\n"
     ]
    }
   ],
   "source": [
    "prompt  = \"List the capitals of all countries in Europe with number of citizens greater than 20 million.\"\n",
    "pprint(utils.llm.parse_prompt(prompt))\n",
    "pprint(utils.llm.link_entities(prompt))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
